//! Контекст виконання функції
console.warn("Контекст виконання функції:");
//? ✴️ Можна з упевненістю сказати, що ключове слово this
//? - це одна з найзаплутаніших концепцій JavaScript на старті навчання.
//? Новачки часто підставляють this методом наукового тику доти,
//? доки скрипт не спрацює.
//? ✳️ Контекст у JavaScript схожий на контекст у реченні:
//? 🔸 Петро біжить швидко, тому що ❗️Петро❗️ намагається зловити поїзд.
//? 🔸 Петро біжить швидко, тому що ✅він✅ намагається зловити поїзд.
//? ✳️ Друге речення звучить лаконічніше. 
//? Підмет речення - Петро, і ми можемо сказати, 
//? що контекст речення - це Петро, 
//? тому що він у центрі уваги у цей конкретний час у реченні. 
//? Навіть займенник «хто» стосується Петі.

//? ✳️ І так само об'єкт може бути поточним контекстом виконання функції.
console.log(
    `%c
    🔴 Петро біжить швидко, тому що ❗️Петро❗️ намагається зловити поїзд.
    `,
    'color: blue; font-size: 16px',
);

const petro1 = {
    username: "Petro",
    showName() {
        console.log(petro1.username);
    },
};
petro1.showName();
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
//? ✳️ Звернення до властивостей об'єкта
//? всередині методів, використовуючи ім'я самого об'єкта,
//? - аналогічно використанню Петро, замість він.
//? ✳️ Всередині функцій можна використовувати 
//? зарезервоване ключове слово this.
//? Під час виконання функції, в this записується 
//? посилання на об'єкт, в контексті якого вона була викликана. 
//? Таким чином, в тілі функції ми можемо отримати доступ 
//? до властивостей і методів цього об'єкта.
console.log(
    `%c
    🟢 Петро біжить швидко, тому що ✅він✅ намагається зловити поїзд.
    `,
    'color: blue; font-size: 16px',
);

const petro2 = {
    username: "Petro",
    showName() {
        console.log(this.username);
    },
};
petro2.showName();
console.log("---------------------------------------------------------------------------------------------");
//! Правила визначення this
console.warn("❗️Правила визначення this❗️:");
//? ✴️ Правило для визначення this
//? - значення контексту всередині функції (не стрілочної)
//? визначається на момент її виклику,
//? а не на момент її створення.
//? Тобто значення this визначається тим,
//? як викликається функція,
//? а не тим, де вона була оголошена.
console.log(
    `%c
    Значення this визначається тим,
    як викликається функція,
    а не тим, де вона була оголошена.
    `,
    'color: red; font-size: 16px',
);
//! this у глобальній області видимості
console.warn("this у глобальній області видимості:");
//? ✴️ У глобальній області видимості,
//? якщо скрипт виконується не в суворому режимі,
//? this посилається на об'єкт ❗️window❗️.
//? В суворому режимі значення this,
//? в глобальній області видимості, буде ❗️undefined❗️.
function foo() {
    console.log("this in function foo():", this);
};
foo(); //! window без "use strict" або undefined з "use strict"
console.log("---------------------------------------------------------------------------------------------");

// <script src="./js/01-fe3-js_16.js" type="module" defer></script>
// <script src="./js/01-fe3-js_16.js"></script>

//! this в методі об'єкта
console.warn("this в методі об'єкта:");
//? ✴️ Якщо функція була викликана як метод об'єкта, 
//? то контекст буде посилатися на об'єкт, 
//? частиною якого є метод.
const petro = {
    username: "Petro",
    showThis() {
        console.log(this);
    },
    showName() {
        console.log(this.username);
    },
};

petro.showThis(); //! {username: "Petro", showThis: ƒ, showName: ƒ}
petro.showName(); //! 'petro'
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

