//! Поняття функції
console.warn("Поняття функції: \n https://ruslan379.github.io/course-fe-html-css/lesson-FE3_09/images/function.png");
//? Функція - це підпрограма, незалежна частина коду,
//? призначена для багаторазового виконання конкретної задачі
//? з різними початковими значеннями.
//? Функції дозволяють структурувати великі програми,
//? зменшують повторення та ізолюють код.
//? Функцію можна уявити у вигляді чорного ящика:
//? вона отримує щось на вході(дані) і повертає щось
//? на виході(результат виконання коду всередині неї).



//! Функціональний вираз (function expression)
console.warn("Функціональний вираз (function expression):");
//? Функціональний вираз(function expression) —
//? звичайне оголошення змінної, значення якої буде функція.
//? Має таку структуру:
//? - ключове слово const,
//? - ім'я функції — це дієслово,
//?   що відповідає на питання "Що зробити?"
//? - ключове слово function,
//? - пара круглих дужок(), в яких можуть бути параметри,
//? - тіло функції у фігурних дужках { }.
let a = 5;
const add = function() {
    console.log("Це функція 'add'");
    a = a * 2;
};
console.log("typeof add:", typeof add); //! function
console.log("add:", add); //! ƒ() { console.log("Це функція 'add'"); }
console.log("--------------------------------------------------------------------------");

//! Виклик функції
console.warn("Виклик функції:");
//? Функція викликається за допомогою
//? імені та круглих дужок,
//? всередині яких можуть бути передані аргументи.
add(); //todo: ▶️,❎ Викликає функцію, але ігнорує її результат.
// let  coffe = add()
// console.log("coffe:", coffe);
// console.log(add()); //todo: ▶️,✅ Викликає функцію та виводить її результат (undefined).

console.log("a:", a);
// const resultA = add(); //todo: ▶️, ✅➡️🅰️ Викликає функцію, а її результат записує у змінну <resultA>.
// console.log("resultA:", resultA); //todo: 🅰️➡️✅ Bиводить результат роботи функції (undefined) із змінної <resultA>.
console.log("--------------------------------------------------------------------------");

//! Приклад створення та результат дії функції
console.warn("Приклад створення та результат дії функції:");
const makingСoffee1 = function() {
    console.log("Змолов каву");
    console.log("Нагрів воду");
    console.log("Роблю каву");
    return "Кава";
};
makingСoffee1(); //todo: ▶️,❎ Викликає функцію, але ігнорує її результат.
console.log("`  `  `  `  `");

console.log(makingСoffee1()); //todo: ▶️,✅ Викликає функцію та виводить її результат ("Кава").
console.log("--------------------------------------------------------------------------");

//! Параметри та аргументи. 
console.warn("Параметри та аргументи:");
//? В круглих дужках після імені функції зазначаються ПАРАМЕТРИ
//? - перелік даних, які функція очікує на момент виклику.
//? При виклику функції за допомогою імені та круглих дужок,
//? всередині цих дужок можуть бути передані АРГУМЕНТИ.
const add2 = function(a, b, c) {
    console.log("Це функція 'add2'");
    // const sum = a + b + c;
    // console.log("sum:", sum);
    // return sum;
    return a + b + c;
};

// add2(1, 2, 3);
// add2(10, 20, 30);
console.log("Виклик функції add2(1, 2, 3):", add2(1, 2, 3));
// const result2 = add2(1, 2, 3);
// console.log("result2:", result2);
console.log("--------------------------------------------------------------------------");

//! Приклад створення та результат дії функції з параметрами та аргументами
console.warn("Приклад створення та результат дії функції з параметрами та аргументами:");
const makingСoffee2 = function (groundCoffee, water) {
    console.log("Змолов каву:", groundCoffee);
    console.log("Нагрів воду:", water);
    console.log("Роблю каву...");
    const coffee = groundCoffee + water;
    return coffee;
};
// makingСoffee2("7 грам", "30 мілілітрів"); //todo: ▶️,❎ Викликає функцію, але ігнорує її результат.
console.log("`  `  `  `  `");

console.log(makingСoffee2("7 грам", " 30 мілілітрів")); //todo: ▶️,✅ Викликає функцію та виводить її результат ("Кава").
console.log("--------------------------------------------------------------------------");
